modm-ext/data.modm.io/docs/svd/header_stm32h742xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC2</name>
      <description>Analog to Digital Converter</description>
      <baseAddress>0x40022100</baseAddress>
      <interrupt>
        <name>ADC</name>
        <description>ADC1 and ADC2 global Interrupts</description>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ADC12_COMMON</name>
      <baseAddress>0x40022300</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>ADC Common status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADRDY_MST</name>
              <description>Master ADC ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOSMP_MST</name>
              <description>End of sampling phase flag of the master ADC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC_MST</name>
              <description>End of regular conversion of the master ADC</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOS_MST</name>
              <description>End of regular sequence flag of the master ADC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_MST</name>
              <description>Overrun flag of the master ADC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOC_MST</name>
              <description>End of injected conversion of the master ADC</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOS_MST</name>
              <description>End of injected sequence flag of the master ADC</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD1_MST</name>
              <description>Analog watchdog 1 flag of the master ADC</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD2_MST</name>
              <description>Analog watchdog 2 flag of the master ADC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD3_MST</name>
              <description>Analog watchdog 3 flag of the master ADC</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JQOVF_MST</name>
              <description>Injected context queue overflow flag of the master ADC</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADRDY_SLV</name>
              <description>Slave ADC ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOSMP_SLV</name>
              <description>End of sampling phase flag of the slave ADC</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOC_SLV</name>
              <description>End of regular conversion of the slave ADC</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOS_SLV</name>
              <description>End of regular sequence flag of the slave ADC</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_SLV</name>
              <description>Overrun flag of the slave ADC</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOC_SLV</name>
              <description>End of injected conversion of the slave ADC</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOS_SLV</name>
              <description>End of injected sequence flag of the slave ADC</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD1_SLV</name>
              <description>Analog watchdog 1 flag of the slave ADC</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD2_SLV</name>
              <description>Analog watchdog 2 flag of the slave ADC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AWD3_SLV</name>
              <description>Analog watchdog 3 flag of the slave ADC</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JQOVF_SLV</name>
              <description>Injected context queue overflow flag of the slave ADC</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>ADC common control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DUAL</name>
              <description>Dual ADC mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INDEPENDENT</name>
                  <description>ADC dual mode disabled (ADC independent mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_SIMULT</name>
                  <description>ADC dual mode enabled: group regular simultaneous</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_INTERL</name>
                  <description>ADC dual mode enabled: Combined group regular interleaved</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_INJ_SIMULT</name>
                  <description>ADC dual mode enabled: group injected simultaneous</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_INJ_ALTERN</name>
                  <description>ADC dual mode enabled: group injected alternate trigger. Works only with external triggers (not internal SW start)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_SIM_INJ_SIM</name>
                  <description>ADC dual mode enabled: Combined group regular simultaneous + group injected simultaneous</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_SIM_INJ_ALT</name>
                  <description>ADC dual mode enabled: Combined group regular simultaneous + group injected alternate trigger</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_REG_INT_INJ_SIM</name>
                  <description>ADC dual mode enabled: Combined group regular interleaved + group injected simultaneous</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DELAY</name>
              <description>Delay between 2 sampling phases</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DELAY_1CYCLE_5</name>
                  <description>ADC multimode delay between two sampling phases: 1.5 ADC clock cycle for all resolution</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_2CYCLES_5</name>
                  <description>ADC multimode delay between two sampling phases: 2.5 ADC clock cycles for all resolution</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_3CYCLES_5</name>
                  <description>ADC multimode delay between two sampling phases: 3.5 ADC clock cycles for all resolution</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_4CYCLES_5</name>
                  <description>ADC multimode delay between two sampling phases: 4.5 ADC clock cycles for 16, 14, 12 or 10 bits resolution</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_4CYCLES_5_8_BITS</name>
                  <description>ADC multimode delay between two sampling phases: 4.5 ADC clock cycles for 8 bits resolution</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_5CYCLES_5</name>
                  <description>ADC multimode delay between two sampling phases: 5.5 ADC clock cycles for 16, 14, 12 bits resolution</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_6CYCLES</name>
                  <description>ADC multimode delay between two sampling phases: 6 ADC clock cycles for 10 or 8 bits resolution</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_6CYCLES_5</name>
                  <description>ADC multimode delay between two sampling phases: 6.5 ADC clock cycles for 16 or 14 bits resolution</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAMDF</name>
              <description>Dual ADC mode Data format</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EACH_ADC</name>
                  <description>ADC multimode group regular conversions are transferred by DMA: each ADC uses its own DMA channel, with its individual DMA transfer settings</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES_32_10B</name>
                  <description>ADC multimode group regular conversions are transferred by DMA, one DMA channel for both ADC (DMA of ADC master). Setting for ADC resolution of 32 (16x2) down to 10 bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES_8B</name>
                  <description>ADC multimode group regular conversions are transferred by DMA, one DMA channel for both ADC (DMA of ADC master). Setting for ADC resolution of 8 bits</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKMODE</name>
              <description>ADC clock mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PRESC</name>
              <description>ADC prescaler</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VREFEN</name>
              <description>VREFINT enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSEN</name>
              <description>Temperature sensor enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATEN</name>
              <description>VBAT enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR</name>
          <description>ADC common regular data register for dual</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDATA_MST</name>
              <description>ADC multimode master group regular conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RDATA_SLV</name>
              <description>ADC multimode slave group regular conversion data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR2</name>
          <description>ADC common regular data register for 32-bit dual mode</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDATA_ALT</name>
              <description>Regular data of the master/slave alternated ADCs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
